# Utiliser Homebrew bundle
# https://github.com/Homebrew/homebrew-bundle

# Taps

tap 'homebrew/dupes'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/homebrew-php'
tap 'caskroom/drivers'

# Définir où placer les applications installées
cask_args appdir: '/Applications'

# Permettre l'installation d'applications de l'AppStore
brew 'mas'

# Réseau
brew 'curl'
brew 'dnsmasq'
brew 'openssh'
brew 'openssl'
brew 'rsync'
brew 'storm'
brew 'wget'
cask 'transmission'

# Terminal
brew 'autojump'
brew 'joe'
brew 'thefuck'
cask 'iterm'

# Améliorations d'interface et usage
cask 'bartender'
cask 'coconutbattery'
cask 'rcdefaultapp'

# Utilitaires divers
cask 'appdelete'
cask 'appshelf'
cask 'disk-inventory-x'
cask 'macid'
cask 'qlmarkdown'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'yemuzip'
cask 'bettertouchtool'
cask 'day-o'
cask 'simplenote'

# Backup et synchro
brew 'mackup'
cask 'carbon-copy-cloner'
cask 'dropbox'
cask 'google-drive'

# Web
cask 'firefoxdeveloperedition'
cask 'google-chrome-canary'
cask 'opera'

# Développement
brew 'git'
brew 'node'
brew 'php71', args: ['with-httpd24']
brew 'pkg-config'
brew 'ruby'
cask 'duet'
# https://github.com/tonsky/FiraCode/wiki#installing-font
cask 'font-fira-code'
cask 'github-desktop'
cask 'java6'
cask 'sequel-pro'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'

# Images
brew 'graphicsmagick'
brew 'gsl'
brew 'imagemagick@6'
cask 'imageoptim'

# Dessins
cask 'xquartz'
cask 'inkscape'

# Vidéos
brew 'ffmpeg'
brew 'youtube-dl'
cask 'catch'
cask 'handbrake'
cask 'licecap'
cask 'screenflow'
cask 'subler'
cask 'subsmarine'
cask 'vlc'

# Photo
cask 'adobe-creative-cloud'

# Communication
cask 'skype'
cask 'slack'